import React from 'react';

const TermsContent: React.FC = () => {
    return (
        <div className="text-[#666] text-[16px] font-normal leading-[1.8] space-y-4 whitespace-pre-wrap">
            <p>{`請您注意：本團隊有權隨時於我們認為必要時修改本服務條款。 `}</p>
            <p>{`只要您連接或使用拍揪所有及營運的網站、服務及/或任何相關的應用程式，即表示您已明示同意接受以下所有條款（以下簡稱「本服務條款」）。本服務條款規範了我們和使用者及其他與 拍揪 互動的相關人員之間的關係。只要您連接或使用 拍揪 服務，即表示您同意本服務條款。如有 拍揪 服務的使用者（以下簡稱「拍揪 使用者」）不同意受此份服務條款中之任何條款拘束，則不應連接或使用 拍揪 服務。 `}</p>

            <p>{`1.	未經有權之人同意或充分授權的情形下，您不得擅自為除了您之外的任何人建立帳號。`}</p>

            <p>{`2.	您不應分享您的密碼或從事其他可能危及您 拍揪 帳號安全之行為。`}</p>
            <p>{`3.	我們對於您在 拍揪 服務上發表的內容不主張任何所有權。「內容」是指您發佈到 拍揪 服務的文字、檔案、圖片、相片、影片、聲音、音樂作品、著作權作品、應用程式或任何其他資料。`}</p>
            <p>{`4.	所有的有償服務之費用均是未稅價。`}</p>
            <p>{`5.	您聲明並保證：(i) 您擁有您在 拍揪 服務上或透過 拍揪 服務發佈之內容，或有權授予以下所列之授權；(ii) 您在 拍揪 服務上或透過 拍揪 服務發佈及使用您的內容並未違反、盜用或侵害任何第三人之權利，包括但不限於隱私權、公開權、著作權、商標及/或其他智慧財產權；(iii) 您同意支付所有因您在 拍揪 服務上或透過 拍揪 服務發佈內容所應支付之權利金、費用及其他款項；且 (iv) 您擁有法定權利及能力簽訂本服務條款。`}</p>
            <p>{`6.	拍揪 服務包含拍揪擁有或授權之內容（以下簡稱「拍揪 內容」）。拍揪  內容受到著作權、商標、專利、營業秘密及其他法律之保護，且在您與拍揪之間，拍揪 擁有 拍揪 內容與 拍揪 服務之所有權利。您不得移除、改變或隱藏包含於 拍揪 內容中或隨附於 拍揪 內容之任何著作權、商標、服務標章或其他所有權之聲明，且您不得重製、修改、改作、製作衍生作品、表演、展示、發布、散布、傳輸、廣播、出售、授權或以其他方式利用 拍揪 內容。`}</p>
            <p>{`7.	拍揪 名稱與標誌是 拍揪 的商標，不得未經 拍揪 事先書面同意，全部或部分複製、模仿或使用。此外，所有頁首圖片、客製化圖形、按鈕圖示與文字，均是 拍揪 的服務標章、商標及/或商業外觀，不得未經 拍揪 事先書面同意，全部或部分複製、模仿或使用。`}</p>
            <p>{`8.	雖然 拍揪 意圖盡量提供 拍揪 服務，但可能因為預定維護或升級、緊急維修，或通訊連結及/或設備故障，而造成 拍揪 服務中斷。`}</p>
            <p>{`9.	拍揪 保留以任何理由將任何內容從 拍揪 服務中移除之權利，且無須事先告知。已從 拍揪 服務中移除之內容可能會由 拍揪 繼續儲存，包括但不限於為了遵守若干法律義務之目的，但可能無法再透過有效法院命令以外之方式檢索。拍揪 鼓勵您自行備份您的內容；除法律另有規定外，拍揪 不是備份服務，您同意不依賴 拍揪 服務之備份或儲存內容。對於您內容之任何修改、暫停或終止，或任何內容之遺失，拍揪 不負任何責任。`}</p>
            <p>{`10.	您同意不從事任何可能干擾或中斷 拍揪 服務或伺服器或網路之行為。您同意不建立 拍揪 帳戶之非授權頁首圖片，或使用自動化裝置、程式碼、機器人、蜘蛛程式、爬蟲程式或代碼擷取程式。您同意不未經授權存取 拍揪 服務之私人 API。`}</p>
            <p>{`11.	我們有權自行判斷拒絕任何人連接或使用 拍揪 服務，且無須事先告知。`}</p>
            <p>{`12.	未經 拍揪 明確書面同意，禁止基於任何未經授權之目的（包括但不限於商業目的），在 拍揪 服務上或透過 拍揪 服務發佈任何內容；或利用 拍揪 服務進行任何互動。`}</p>
            <p>{`13.	由 拍揪 服務提供之連結往其他網站或資源，或是由其他網站或資源連結到 拍揪 服務，您知悉並同意，拍揪 不控制也沒有責任審查該連結網站所提供之內容、廣告、產品、服務或其他資料，且不為其負責，拍揪 也不為您因使用或信賴該連結網站所提供之任何內容、廣告、產品、服務或其他資料所生之任何損害或損失負責。`}</p>
            <p>{`14.	違反本服務條款可能導致（由 拍揪 自行判斷）您的 拍揪 帳戶被終止。我們得在無須事先告知的情況下，移除、刪除、取消、編輯、改變、修改及/或封鎖您的 拍揪 帳戶及/或您發表的全部或部分內容。 `}</p>
            <p>{`15.	您對於您發表的內容及/或您與其他 拍揪 使用者的互動須負完全的責任，無論是上線或離線的狀態。您同意 拍揪 對於任何 拍揪 使用者的行為無須負任何責任；但如我們認為合適時，我們得參與您與其他 拍揪 使用者間的爭議。`}</p>
        </div>
    );
};

export default TermsContent;
